Autodesk.Revit.DB.TableView.IsOkToEditParam(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Prompts the user to see if it is OK to edit the type parameter associated with a given table cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sectionType is not a valid type for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration